src/cf/InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУстановкиВремениНапоминания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыУстановкиВремениНапоминания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалВремениНапоминания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРеквизитаИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеИсточника</Name>
					<Comment>Представление источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметНапоминания</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСобытияПоПеревозке_уэ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСобытияПоПеревозке_уэ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сформировано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДнейОтДатыНачалаПеревозки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДнейОтДатыНачалаПеревозки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыСобытий_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПеревозки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.Задание</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмоИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапланированноеВзаимодействие</v8:Type>
						<v8:Type>cfg:DocumentRef.ТелефонныйЗвонок</v8:Type>
						<v8:Type>cfg:DocumentRef.Встреча</v8:Type>
						<v8:Type>cfg:DocumentRef.СообщениеSMS</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыДокументовСобытийПоПеревозке_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСвязанныеДокументыЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСвязанныеДокументыЭПД</Name>
			<Comment>(уат)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>QR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭПД</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйЗаказЗаявка</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяТранспортнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектроннаяСопроводительнаяВедомость</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаТС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказПеревозчику_уэ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/уатСтатусыПЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСтатусыПЛ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСтатусы_уэ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПутевойЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатПутевойЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/РеестрЭПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РеестрЭПД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипСсылки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перевозчик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникЭДО_ЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЭПД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЭПД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокументаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокументаИБ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийШаг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийШагВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МобильноеПриложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторЗаписиМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийШагМП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОжидаемПросмотрМП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСобытияМП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РольУчастника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыЭПД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатСостоянияТранспортныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатСостоянияТранспортныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПройден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/уатОбработчикиПодписокНаСобытия/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОДПИСОК НА СОБЫТИЯ
///////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Процедура вызывает обработчик, устанавливающий префикс номера документа 
// в зависимости от организации
//  Парам.
//  СтандартнаяОбработка - использование стандартной обработки
//  Источник - источник события
//  Префикс - префикс организации
Процедура уатПриУстановкеНовогоНомераДокументаПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	Если Источник.Метаданные().Имя = "уатСчетФактураВыданный" Тогда
		Документы.уатСчетФактураВыданный.УстановитьПрефиксНомера(Источник, Префикс);
		Возврат;
	КонецЕсли;
	
	уатОбщегоНазначенияТиповые.уатДобавитьПрефиксОрганизации(Источник, Префикс);
	уатОбщегоНазначенияТиповые.уатДобавитьПрефиксУзла(Префикс);
КонецПроцедуры

// Процедура вызывает обработчик, устанавливающий префикс кода справочника
//  Парам.
//  СтандартнаяОбработка - использование стандартной обработки
//  Источник - источник события
//  Префикс - префикс организации  
Процедура уатПриУстановкеНовогоКодаСправочникаПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	уатОбщегоНазначенияТиповые.уатДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

// Проверка прав перед записью документа УАТ
//
Процедура ПередЗаписьюДокументаПроверкаПрав(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ИдетЗагрузкаДанных = Ложь;
	Попытка	ИдетЗагрузкаДанных = Источник.ОбменДанными.Загрузка;
	Исключение КонецПопытки; 
	Если ИдетЗагрузкаДанных ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	//Если РежимПроведения = Неопределено Тогда
	//	РежимПроведения = РежимПроведенияДокумента.Неоперативный;
	//КонецЕсли;
	
	// проверка прав
	уатОбщегоНазначенияСервер.ПроверкаПравПередЗаписьюВДокументах(Источник, Отказ);
КонецПроцедуры

// Проверка прав перед записью справочника УАТ
//
Процедура ПередЗаписьюСправочникаПроверкаПрав(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ИдетЗагрузкаДанных = Ложь;
	Попытка	ИдетЗагрузкаДанных = Источник.ОбменДанными.Загрузка;
	Исключение КонецПопытки; 
	Если ИдетЗагрузкаДанных ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// проверка прав
	уатОбщегоНазначенияСервер.ПроверкаПравПередЗаписьюВСправочниках(Источник, Отказ);
КонецПроцедуры

// Вызов данное процедуры происходит перед записью элемента типовых справочников
// Когда необходимо выполнить какие-либо проверки на возможность записи.
//
// Параметры:
//  Источник     - справочник объект - записываемый договор
//  Отказ        - признак отказа от записи.
//
Процедура уатПередЗаписьюЭлементаТиповыхСправочников(Источник,Отказ) Экспорт
	ИдетЗагрузкаДанных = Ложь;
	Попытка	ИдетЗагрузкаДанных = Источник.ОбменДанными.Загрузка;
	Исключение КонецПопытки; 
	Если ИдетЗагрузкаДанных Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

// Вызов данное процедуры происходит перед записью элемента типовых справочников
// Когда необходимо выполнить какие-либо проверки на возможность записи.
//
// Параметры:
//  Источник     - справочник объект - записываемый договор
//  Отказ        - признак отказа от записи.
//
Процедура уатПриЗаписиЭлементаТиповыхСправочников(Источник,Отказ) Экспорт
	
	Заглушка = Истина;
	
	// В этой процедуре ранее размещалась установка прав и настроек 
	// для разрешения новому пользователю работы с программой и подсистемой экспедирования
	// в текущей версии используются настройки, подставляемые по умолчанию

КонецПроцедуры

// Проверяет корректность префикса номера документа по организации
// Источником подписки должен быть документ, в котором есть реквизит Организация
//
Процедура ПроверитьНомерОбъектаПоДатеИОрганизации(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	ИначеЕсли Источник.ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", Источник.Метаданные())
		И Источник.Ссылка.Организация.Префикс <> Источник.Организация.Префикс
		ИЛИ НЕ ПрефиксацияОбъектовСлужебный.ДатыОбъектаОдногоПериода(Источник.Ссылка.Дата, Источник.Дата, Источник.Ссылка) Тогда
		Источник.Номер = "";
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет автоматическое создание напоминаний пользователю при создании задач по бизнес-процессу "уатСогласование"
//
Процедура уатСозданиеНапоминанийПоСогласованиямПриЗаписи(Источник, Отказ) Экспорт
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.НапоминанияПользователя") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не Константы.ИспользоватьНапоминанияПользователя.Получить() Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(Источник.БизнесПроцесс) = Тип("БизнесПроцессСсылка.уатСогласование") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(Источник.Исполнитель) = Тип("СправочникСсылка.Пользователи") Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	мЗапрос.УстановитьПараметр("Источник", Источник.Ссылка);
	
	мЗапрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НапоминанияПользователя.Источник
	|ИЗ
	|	РегистрСведений.НапоминанияПользователя КАК НапоминанияПользователя
	|ГДЕ
	|	НапоминанияПользователя.Источник = &Источник";
	
	Если мЗапрос.Выполнить().Пустой() Тогда 
		МенЗап = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
		МенЗап.Пользователь    						= Источник.Исполнитель;
		МенЗап.ВремяСобытия    						= Источник.СрокИсполнения;
		МенЗап.Источник        						= Источник.Ссылка;
		МенЗап.СрокНапоминания 						= ТекущаяДата();
		МенЗап.Описание        						= Источник.Наименование;
		МенЗап.ИнтервалВремениНапоминания			= 0;
		МенЗап.СпособУстановкиВремениНапоминания 	= Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
		МенЗап.ВремяСобытия 						= МенЗап.СрокНапоминания ;
		МенЗап.ПредставлениеИсточника            	= ОбщегоНазначения.ПредметСтрокой(Источник.Ссылка);
		МенЗап.Записать(Истина);
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура обработчик подписки на событие "уатПриИзмененииИспользованияБизнесПроцессовИЗадач"
//
Процедура уатПриИзмененииИспользованияБизнесПроцессовИЗадач(Источник, Отказ) Экспорт
	
	Если Не Источник.Значение Тогда 
		Константы.уатИспользоватьСогласованиеДокументов.Установить(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик подписки на событие "уатУстановитьИспользованиеПодсистемыCRM"
//
Процедура уатУстановитьИспользованиеПодсистемыCRMПриЗаписи(Источник, Отказ) Экспорт
	
	ИспользованиеCRM = Ложь;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого ТекТип Из Метаданные.ПодпискиНаСобытия.уатУстановитьИспользованиеПодсистемыCRM.Источник.Типы() Цикл 
		МенеджерКонстанты = Новый(ТекТип);
		МенеджерКонстанты.Прочитать();
		
		Если МенеджерКонстанты.Значение Тогда 
			ИспользованиеCRM = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Константы.уатИспользоватьCRM.Установить(ИспользованиеCRM);
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Процедура обработчик подписки на событие "уатОбработкаПроведенияДокументаОбновитьПланыРемонтныхРабот"
//
Процедура ОбработкаПроведенияДокументаОбновитьПланыРемонтныхРабот(Источник, Отказ, РежимПроведения) Экспорт
	
	ИдетЗагрузкаДанных = Ложь;
	Попытка	ИдетЗагрузкаДанных = Источник.ОбменДанными.Загрузка;
	Исключение КонецПопытки; 
	Если ИдетЗагрузкаДанных ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТранспортныеСредства = Новый Массив();
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.уатПутевойЛист") Тогда
		ТранспортныеСредства.Добавить(Источник.ТранспортноеСредство);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатРемонтныйЛист") Тогда
		ТранспортныеСредства.Добавить(Источник.ТС);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатВводВЭксплуатациюТСиОборудования") Тогда
		Для Каждого ТекСтрока Из Источник.ТС Цикл
			ТранспортныеСредства.Добавить(ТекСтрока.ТС);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.уатВводНачальныхПоказаний") Тогда
		Для Каждого ТекСтрока Из Источник.Спидометр Цикл
			ТранспортныеСредства.Добавить(ТекСтрока.ТС);
		КонецЦикла;
		Для Каждого ТекСтрока Из Источник.ИсторияПрохожденияТО Цикл
			ТранспортныеСредства.Добавить(ТекСтрока.ТС);
		КонецЦикла;
	КонецЕсли;
	
	уатОбщегоНазначения.ОбновитьПланыРемонтныхРабот(ТранспортныеСредства);

КонецПроцедуры

// Процедура обработчик подписки на событие "уатОбработкаПолученияФормыОтчета"
//
Процедура уатОбработкаПолученияФормыОтчета(Источник, ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если Параметры.Свойство("ИмяОтчета") Тогда
		ИмяКлючевойОперации = "уатОтчеты." + Параметры.ИмяОтчета;
		ЦентрМониторинга.ЗаписатьОперациюБизнесСтатистики(ИмяКлючевойОперации, 1);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработчик подписки на событие "уатОбработкаСобытийПоПеревозке"
//
Процедура уатОбработкаСобытийПоПеревозке(Источник, Отказ) Экспорт
	
	Если НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП()
		ИЛИ НЕ ПолучитьФункциональнуюОпцию("уатИспользоватьУведомления_уэ") Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Источник",    Источник.Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	уатСобытияПоПеревозке_уэ.ТипСобытия КАК ТипСобытия,
	               |	уатСобытияПоПеревозке_уэ.ДокументПеревозки КАК ДокументПеревозки,
	               |	уатСобытияПоПеревозке_уэ.Событие КАК Событие,
	               |	уатСобытияПоПеревозке_уэ.ДатаПлан КАК ДатаПлан,
	               |	уатСобытияПоПеревозке_уэ.Сформировано КАК Сформировано,
	               |	уатСобытияПоПеревозке_уэ.Выполнено КАК Выполнено,
	               |	ВЫБОР
	               |		КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.Встреча)
	               |			ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаОкончания
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ЗапланированноеВзаимодействие)
	               |					ТОГДА уатСобытияПоПеревозке_уэ.Событие.Дата
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.СообщениеSMS)
	               |							ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаКогдаОтправить
	               |						ИНАЧЕ ВЫБОР
	               |								КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ТелефонныйЗвонок)
	               |									ТОГДА уатСобытияПоПеревозке_уэ.Событие.Дата
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ЭлектронноеПисьмоИсходящее)
	               |											ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаОтправления
	               |										ИНАЧЕ ВЫБОР
	               |												КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(БизнесПроцесс.Задание)
	               |													ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаЗавершения
	               |												ИНАЧЕ &ТекущаяДата
	               |											КОНЕЦ
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					КОНЕЦ
	               |			КОНЕЦ
	               |	КОНЕЦ КАК ДатаФакт
	               |ИЗ
	               |	РегистрСведений.уатСобытияПоПеревозке_уэ КАК уатСобытияПоПеревозке_уэ
	               |ГДЕ
	               |	уатСобытияПоПеревозке_уэ.Событие = &Источник
	               |	И уатСобытияПоПеревозке_уэ.Выполнено = ЛОЖЬ
	               |	И ВЫБОР
	               |			КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.Встреча)
	               |				ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаОкончания <= &ТекущаяДата
	               |						И уатСобытияПоПеревозке_уэ.Событие.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1)
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ЗапланированноеВзаимодействие)
	               |						ТОГДА уатСобытияПоПеревозке_уэ.Событие.Дата <= &ТекущаяДата
	               |								И уатСобытияПоПеревозке_уэ.Событие.Дата <> ДАТАВРЕМЯ(1, 1, 1)
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.СообщениеSMS)
	               |								ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаКогдаОтправить <= &ТекущаяДата
	               |										И уатСобытияПоПеревозке_уэ.Событие.ДатаКогдаОтправить <> ДАТАВРЕМЯ(1, 1, 1)
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ТелефонныйЗвонок)
	               |										ТОГДА уатСобытияПоПеревозке_уэ.Событие.Дата <= &ТекущаяДата
	               |												И уатСобытияПоПеревозке_уэ.Событие.Дата <> ДАТАВРЕМЯ(1, 1, 1)
	               |									ИНАЧЕ ВЫБОР
	               |											КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(Документ.ЭлектронноеПисьмоИсходящее)
	               |												ТОГДА уатСобытияПоПеревозке_уэ.Событие.ДатаОтправления <= &ТекущаяДата
	               |														И уатСобытияПоПеревозке_уэ.Событие.ДатаОтправления <> ДАТАВРЕМЯ(1, 1, 1)
	               |											ИНАЧЕ ВЫБОР
	               |													КОГДА ТИПЗНАЧЕНИЯ(уатСобытияПоПеревозке_уэ.Событие) = ТИП(БизнесПроцесс.Задание)
	               |														ТОГДА уатСобытияПоПеревозке_уэ.Событие.Завершен
	               |													ИНАЧЕ ЛОЖЬ
	               |												КОНЕЦ
	               |										КОНЕЦ
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ
	               |		КОНЕЦ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.уатСобытияПоПеревозке_уэ.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ТипСобытия.Установить(Выборка.ТипСобытия);
		НаборЗаписей.Отбор.ДокументПеревозки.Установить(Выборка.ДокументПеревозки);
		НаборЗаписей.Отбор.Событие.Установить(Выборка.Событие);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() <> 0 Тогда
			НаборЗаписей[0].Выполнено = Истина;
			НаборЗаписей[0].ДатаФакт  = Выборка.ДатаФакт;
			Попытка
				НаборЗаписей.Записать();
			Исключение
			КонецПопытки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Вызов данное процедуры происходит при записи документа ЭПД.
//
// Параметры:
//  Источник     - Документ объект
//  Отказ        - признак отказа от записи.
//
Процедура уатПриЗаписиДокументаЭПД(Источник, Отказ) Экспорт
	
	Если Источник.ДополнительныеСвойства.Свойство("НеПересчитывать") Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронныйПутевойЛист") Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЭлектронныйПутевойЛистДокументыОснования.Ссылка КАК Ссылка,
		|	ЭлектронныйПутевойЛистДокументыОснования.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	Документ.ЭлектронныйПутевойЛист.ДокументыОснования КАК ЭлектронныйПутевойЛистДокументыОснования
		|ГДЕ
		|	ЭлектронныйПутевойЛистДокументыОснования.Ссылка = &Ссылка";
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.ЭПД       = Источник.Ссылка;
			МенеджерЗаписи.Рейс      = Выборка.ДокументОснование;
			МенеджерЗаписи.Записать(Истина);
		КонецЦикла;
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронныйЗаказЗаявка") 
		ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектроннаяТранспортнаяНакладная") Тогда
		
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЭлектронныйЗаказЗаявка") Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЭлектронныйЗаказЗаявкаДокументыОснования.Ссылка КАК Ссылка,
			|	ЭлектронныйЗаказЗаявкаДокументыОснования.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Документ.ЭлектронныйЗаказЗаявка.ДокументыОснования КАК ЭлектронныйЗаказЗаявкаДокументыОснования
			|ГДЕ
			|	ЭлектронныйЗаказЗаявкаДокументыОснования.Ссылка = &Ссылка";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка КАК Ссылка,
			|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.ДокументОснование КАК ДокументОснование
			|ИЗ
			|	Документ.ЭлектроннаяТранспортнаяНакладная.ДокументыОснования КАК ЭлектроннаяТранспортнаяНакладнаяДокументыОснования
			|ГДЕ
			|	ЭлектроннаяТранспортнаяНакладнаяДокументыОснования.Ссылка = &Ссылка";
		КонецЕсли;

		Выборка = Запрос.Выполнить().Выбрать();
		
		МассивДокументОснование = Новый Массив();
		МассивЗаказов           = Новый Массив();
		МассивРейсов            = Новый Массив();
		СоответвиеРейсов        = Новый Соответствие();
		Пока Выборка.Следующий() Цикл
			Если ТипЗнч(Выборка.ДокументОснование) = Тип("ДокументСсылка.уатЗаказГрузоотправителя") Тогда
				МассивЗаказов.Добавить(Выборка.ДокументОснование);
			Иначе
				МассивРейсов.Добавить(Выборка.ДокументОснование);
			Конецесли;
			МассивДокументОснование.Добавить(Выборка.ДокументОснование);
		КонецЦикла;
		
		СвязанныеДокументыРейса = Новый Соответствие();
		Если МассивЗаказов.Количество() <> 0
			И МассивРейсов.Количество() <> 0 Тогда 
			Для Каждого ТекЗаказ Из МассивЗаказов Цикл
				Запрос = Новый Запрос(); 
				Запрос.УстановитьПараметр("Заказ", ТекЗаказ);
				Запрос.УстановитьПараметр("МассивРейсов", МассивРейсов);
				
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	СвязанныеДокументы.Ссылка КАК Рейс,
				|	&Заказ КАК Заказ
				|ИЗ
				|	КритерийОтбора.СвязанныеДокументы(&Заказ) КАК СвязанныеДокументы
				|ГДЕ
				|	СвязанныеДокументы.Ссылка.ПометкаУдаления = ЛОЖЬ
				|	И СвязанныеДокументы.Ссылка В(&МассивРейсов)";
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда 
								
					МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
					МенеджерЗаписи.ЭПД       = Источник.Ссылка;
					МенеджерЗаписи.ЗаказНаТС = ТекЗаказ;
					МенеджерЗаписи.Записать(Истина);
					
				Иначе 

					Выборка = РезультатЗапроса.Выбрать();
					Пока Выборка.Следующий() Цикл  
						
						ТекРейс = СоответвиеРейсов.Получить(Выборка.Рейс);
						Если ТекРейс = Неопределено Тогда
							ТекРейс = Выборка.Рейс;
						КонецЕсли;
						
						МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
						МенеджерЗаписи.ЭПД       = Источник.Ссылка;
						МенеджерЗаписи.ЗаказНаТС = ТекЗаказ;
						МенеджерЗаписи.Рейс      = ТекРейс;
						МенеджерЗаписи.Записать(Истина);
						
						СвязанныеДокументыРейса.Вставить(ТекЗаказ, ТекРейс);
						СвязанныеДокументыРейса.Вставить(ТекРейс, ТекЗаказ);
						
						ТекРейс = МассивРейсов.Найти(Выборка.Рейс);
						Если ТекРейс <> Неопределено Тогда
							МассивРейсов.Удалить(ТекРейс);
						Конецесли;
					КонецЦикла;
					
					Для Каждого ДокументОснование Из МассивРейсов Цикл 
						МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
						МенеджерЗаписи.ЭПД       = Источник.Ссылка;
						МенеджерЗаписи.Рейс      = ДокументОснование;
						
						Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Рейс) Тогда
							Продолжить;
						КонецЕсли;
						МенеджерЗаписи.Записать(Истина);
					КонецЦикла; 
					
					// Удаляем лишние записи
					МассивДляУдаления = Новый Массив();
					НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
					НаборЗаписей.Отбор.ЭПД.Установить(Источник.Ссылка);
					НаборЗаписей.Отбор.ЗаказНаТС.Установить(ТекЗаказ);
					НаборЗаписей.Прочитать();
					
					Для Каждого Запись из НаборЗаписей Цикл 
						УдалитьЗапись = Ложь;
						Если НЕ ЗначениеЗаполнено(Запись.Рейс) Тогда
							МассивДляУдаления.Добавить(Запись);
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого ТекЗапись Из МассивДляУдаления Цикл
						НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
						НаборЗаписей.Отбор.ЭПД.Установить(Источник.Ссылка); 
						НаборЗаписей.Отбор.ЗаказНаТС.Установить(ТекЗапись.ЗаказНаТС);
						НаборЗаписей.Отбор.Рейс.Установить(ТекЗапись.Рейс);
						НаборЗаписей.Записать(); 
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли МассивЗаказов.Количество() <> 0 Тогда
			
			Для Каждого ДокументОснование Из МассивЗаказов Цикл 
				
				МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.ЭПД       = Источник.Ссылка;
				МенеджерЗаписи.ЗаказНаТС = ДокументОснование;
				МенеджерЗаписи.Записать(Истина);
				
			КонецЦикла;
		ИначеЕсли МассивРейсов.Количество() <> 0 Тогда
			
			Для Каждого ДокументОснование Из МассивРейсов Цикл 
				
				МенеджерЗаписи = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.ЭПД       = Источник.Ссылка;
				МенеджерЗаписи.Рейс      = ДокументОснование;
				Если НЕ ЗначениеЗаполнено(МенеджерЗаписи.Рейс) Тогда
					Продолжить;
				КонецЕсли;
				МенеджерЗаписи.Записать(Истина);
				
			КонецЦикла;  
			
		КонецЕсли;
		
		МассивДляУдаления = Новый Массив();
		НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ЭПД.Установить(Источник.Ссылка);
		НаборЗаписей.Прочитать();
		
		Для Каждого Запись из НаборЗаписей Цикл
			УдалитьЗапись     = Ложь; 
			ЕстьСвязанныйРейс = СвязанныеДокументыРейса.Получить(Запись.ЗаказНаТС) <> Неопределено
				ИЛИ СвязанныеДокументыРейса.Получить(Запись.Рейс) <> Неопределено;
			
			Если ЗначениеЗаполнено(Запись.ЗаказНаТС) Тогда
				Если массивДокументОснование.Найти(Запись.ЗаказНаТС) = Неопределено Тогда
					УдалитьЗапись = Истина;
				КонецЕсли;
			ИначеЕсли массивДокументОснование.Найти(Запись.Рейс) <> Неопределено 
				И ЕстьСвязанныйРейс Тогда
				НаборЗаписейРейс = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
				НаборЗаписейРейс.Отбор.ЭПД.Установить(Источник.Ссылка);
				НаборЗаписейРейс.Отбор.Рейс.Установить(Запись.Рейс);
				НаборЗаписейРейс.Прочитать();
				Если НаборЗаписейРейс.Количество() > 1 Тогда
					УдалитьЗапись = Истина;
				КонецЕсли;
			Конецесли;
			Если ЗначениеЗаполнено(Запись.Рейс) Тогда
				Если массивДокументОснование.Найти(Запись.Рейс) = Неопределено Тогда
					УдалитьЗапись = Истина; 
				КонецЕсли;
			ИначеЕсли массивДокументОснование.Найти(Запись.ЗаказНаТС) <> Неопределено
				И ЕстьСвязанныйРейс Тогда
				НаборЗаписейЗаказ = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
				НаборЗаписейЗаказ.Отбор.ЭПД.Установить(Источник.Ссылка);
				НаборЗаписейЗаказ.Отбор.ЗаказНаТС.Установить(Запись.ЗаказНаТС);
				НаборЗаписейЗаказ.Прочитать();
				Если НаборЗаписейЗаказ.Количество() > 1 Тогда
					УдалитьЗапись = Истина;
				КонецЕсли;
			Конецесли;
			Если УдалитьЗапись Тогда
				МассивДляУдаления.Добавить(Запись); 
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекЗапись Из МассивДляУдаления Цикл
			НаборЗаписей = РегистрыСведений.уатСвязанныеДокументыЭПД.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ЭПД.Установить(Источник.Ссылка); 
			НаборЗаписей.Отбор.ЗаказНаТС.Установить(ТекЗапись.ЗаказНаТС);
			НаборЗаписей.Отбор.Рейс.Установить(ТекЗапись.Рейс);
			НаборЗаписей.Записать(); 
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Вызов данное процедуры происходит при записи документа ЭПД.
//
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияПоОбъектамУчетаЭДО - Набор записей регистра сведений
//  Отказ - Булево - Признак отказа от записи
//  Замещение - Булево - Замещение.
//
Процедура уатПриЗаписиРеестрЭПД(Источник, Отказ, Замещение) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат; 
	КонецЕсли;
	
	Для Каждого ТекДокумент Из Источник.ДополнительныеСвойства.СоответвиеСостояний Цикл
		ЭПЛ         = ТекДокумент.Ключ;
		Состояние   = ТекДокумент.Значение.Состояние;
		Выполнен    = ТекДокумент.Значение.Выполнен;
		ОтменаРейса = ЭПЛ.ТекущийТитул = Перечисления.ТипыЭлементовРегламентаЭДО.ЭПЛ_ОткМ
			ИЛИ (ЭПЛ.ТитулВыпускРезультатПроведенияПредсменногоКонтроля = "2" И Состояние = "Контроль транспорта");
		Для Каждого ТекПЛ Из ЭПЛ.ДокументыОснования Цикл
			Если Выполнен Тогда
				СостояниеПодписей = Перечисления.уатСостоянияТранспортныхДокументов.Подписан;
			Иначе
				СостояниеПодписей = Перечисления.уатСостоянияТранспортныхДокументов.Создан;
			КонецЕсли;
			
			НовыйСтатус = Неопределено;
			ВидПодписи  = Неопределено;	
			Если Состояние = "Оформление" Тогда  
				ВидПодписи = "ДиспетчерПредрейсовый";
				НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул1;
			ИначеЕсли Состояние = "Контроль транспорта" Тогда 
				Если НЕ Выполнен Тогда
					СоответвиеПЛЭД      = Новый Соответствие();
					СостоянияПодписейПЛ = Новый Соответствие();
					
					мсвПутевыеЛисты     = Новый Массив();
					мсвПутевыеЛисты.Добавить(ТекПЛ.ДокументОснование);
					уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД); 
					
					ДанныеЭПЛ      = СоответвиеПЛЭД.Получить(ТекПЛ.ДокументОснование);
					ДанныеПодписей = СостоянияПодписейПЛ.Получить(ТекПЛ.ДокументОснование);
					Если ДанныеЭПЛ <> Неопределено
						И ДанныеПодписей <> Неопределено Тогда  
						Если ЗначениеЗаполнено(ТекПЛ.ДокументОснование.Водитель2) Тогда
							Если ((ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель2Подписан) 
								ИЛИ (ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель1 = ТекПЛ.ДокументОснование.Водитель2) 
								ИЛИ (ДанныеЭПЛ.Титул2Водитель2Подписан
								И ДанныеЭПЛ.Титул2Водитель2 = ТекПЛ.ДокументОснование.Водитель2)  
								ИЛИ (ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель2)
								И НЕ ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель1)))
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникВодитель2Предрейсовый) Тогда
								ВидПодписи  = "МедработникВодитель2Предрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
							Если (ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель1 = ТекПЛ.ДокументОснование.Водитель1)
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникПредрейсовый) Тогда
								ВидПодписи  = "МедработникПредрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
						Иначе
							Если ДанныеЭПЛ.Титул2Подписан
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникПредрейсовый) Тогда
								ВидПодписи  = "МедработникПредрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли; 
				КонецЕсли;
				ВидПодписи  = "КонтролерПредрейсовый";
				НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул3;
			ИначеЕсли Состояние = "Медосмотр" Тогда
				
				Если НЕ Выполнен Тогда
					СоответвиеПЛЭД      = Новый Соответствие();
					СостоянияПодписейПЛ = Новый Соответствие();
					
					мсвПутевыеЛисты     = Новый Массив();
					мсвПутевыеЛисты.Добавить(ТекПЛ.ДокументОснование);
					уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД); 
					
					ДанныеЭПЛ      = СоответвиеПЛЭД.Получить(ТекПЛ.ДокументОснование);
					ДанныеПодписей = СостоянияПодписейПЛ.Получить(ТекПЛ.ДокументОснование);
					Если ДанныеЭПЛ <> Неопределено
						И ДанныеПодписей <> Неопределено Тогда  
						Если ДанныеЭПЛ.Титул3Подписан
							И НЕ ЗначениеЗаполнено(ДанныеПодписей.КонтролерПредрейсовый) Тогда
							ВидПодписи  = "КонтролерПредрейсовый"; 
							уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
							Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ТекПЛ.ДокументОснование.Водитель2) Тогда 
					СоответвиеПЛЭД      = Новый Соответствие();
					СостоянияПодписейПЛ = Новый Соответствие();
					
					мсвПутевыеЛисты     = Новый Массив();
					мсвПутевыеЛисты.Добавить(ТекПЛ.ДокументОснование);
					уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД);
					ДанныеЭПЛ = СоответвиеПЛЭД.Получить(ТекПЛ.ДокументОснование);
					
					Если ДанныеЭПЛ = Неопределено Тогда
						ВидПодписи = "МедработникПредрейсовый"; 
						НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
					Иначе 
						Если ДанныеЭПЛ.Титул2Подписан
							И ДанныеЭПЛ.Титул2Водитель2Подписан Тогда
							ВидПодписи = "МедработникВодитель2Предрейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
						ИначеЕсли (ДанныеЭПЛ.Титул2Подписан
							И ДанныеЭПЛ.Титул2Водитель1 = ТекПЛ.ДокументОснование.Водитель2) 
							ИЛИ (ДанныеЭПЛ.Титул2Водитель2Подписан
							И ДанныеЭПЛ.Титул2Водитель2 = ТекПЛ.ДокументОснование.Водитель2) Тогда
							ВидПодписи = "МедработникВодитель2Предрейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2; 
						ИначеЕсли ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель2)
							И НЕ ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель1) Тогда
							ВидПодписи = "МедработникВодитель2Предрейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
						Иначе  
							ВидПодписи = "МедработникПредрейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ВидПодписи = "МедработникПредрейсовый"; 
					НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
				КонецЕсли;
			ИначеЕсли Состояние = "Показания (выезд)" Тогда  
				Если НЕ Выполнен Тогда
					СоответвиеПЛЭД      = Новый Соответствие();
					СостоянияПодписейПЛ = Новый Соответствие();
					
					мсвПутевыеЛисты     = Новый Массив();
					мсвПутевыеЛисты.Добавить(ТекПЛ.ДокументОснование);
					уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД); 
					
					ДанныеЭПЛ      = СоответвиеПЛЭД.Получить(ТекПЛ.ДокументОснование);
					ДанныеПодписей = СостоянияПодписейПЛ.Получить(ТекПЛ.ДокументОснование);
					Если ДанныеЭПЛ <> Неопределено
						И ДанныеПодписей <> Неопределено Тогда  
						Если ДанныеЭПЛ.Титул3Подписан
							И НЕ ЗначениеЗаполнено(ДанныеПодписей.КонтролерПредрейсовый) Тогда
							ВидПодписи  = "КонтролерПредрейсовый"; 
							уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
							Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
						КонецЕсли; 
						
						Если ЗначениеЗаполнено(ТекПЛ.ДокументОснование.Водитель2) Тогда
							Если ((ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель2Подписан) 
								ИЛИ (ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель1 = ТекПЛ.ДокументОснование.Водитель2) 
								ИЛИ (ДанныеЭПЛ.Титул2Водитель2Подписан
								И ДанныеЭПЛ.Титул2Водитель2 = ТекПЛ.ДокументОснование.Водитель2)  
								ИЛИ (ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель2)
								И НЕ ЗначениеЗаполнено(ДанныеЭПЛ.Титул2Водитель1)))
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникВодитель2Предрейсовый) Тогда
								ВидПодписи  = "МедработникВодитель2Предрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
							Если (ДанныеЭПЛ.Титул2Подписан
								И ДанныеЭПЛ.Титул2Водитель1 = ТекПЛ.ДокументОснование.Водитель1)
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникПредрейсовый) Тогда
								ВидПодписи  = "МедработникПредрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
						Иначе
							Если ДанныеЭПЛ.Титул2Подписан
								И НЕ ЗначениеЗаполнено(ДанныеПодписей.МедработникПредрейсовый) Тогда
								ВидПодписи  = "МедработникПредрейсовый"; 
								НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул2;
								уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи,
								Перечисления.уатСостоянияТранспортныхДокументов.Подписан);
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
				
				ВидПодписи = "УполномоченныйНаПроставлениеОдометраПредрейсовый"; 
				НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул4;
			ИначеЕсли Состояние = "Показания (заезд)" Тогда
				ВидПодписи = "УполномоченныйНаПроставлениеОдометраПослерейсовый";
				НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул5;
			ИначеЕсли Состояние = "Медосмотр (после рейса)" Тогда   
				
				Если ЗначениеЗаполнено(ТекПЛ.ДокументОснование.Водитель2) Тогда 
					СоответвиеПЛЭД      = Новый Соответствие();
					СостоянияПодписейПЛ = Новый Соответствие();
					
					мсвПутевыеЛисты     = Новый Массив();
					мсвПутевыеЛисты.Добавить(ТекПЛ.ДокументОснование);
					уатОбменСГИСЭПД.ЗаполнитьСостоянияПЛ(мсвПутевыеЛисты, СостоянияПодписейПЛ, СоответвиеПЛЭД);
					ДанныеЭПЛ = СоответвиеПЛЭД.Получить(ТекПЛ.ДокументОснование);
					
					Если ДанныеЭПЛ = Неопределено Тогда
						ВидПодписи = "МедработникПослерейсовый"; 
						НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
					Иначе 
						
						Если ДанныеЭПЛ.Титул6Подписан
							И ДанныеЭПЛ.Титул6Водитель2Подписан Тогда
							ВидПодписи = "МедработникВодитель2Послерейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
						ИначеЕсли (ДанныеЭПЛ.Титул6Подписан
							И ДанныеЭПЛ.Титул6Водитель1 = ТекПЛ.ДокументОснование.Водитель2) 
							ИЛИ (ДанныеЭПЛ.Титул6Водитель2Подписан
							И ДанныеЭПЛ.Титул6Водитель2 = ТекПЛ.ДокументОснование.Водитель2) Тогда
							ВидПодписи = "МедработникВодитель2Послерейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
						ИначеЕсли ЗначениеЗаполнено(ДанныеЭПЛ.Титул6Водитель2)
							И НЕ ЗначениеЗаполнено(ДанныеЭПЛ.Титул6Водитель1) Тогда
							ВидПодписи = "МедработникВодитель2Послерейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
						Иначе
							ВидПодписи = "МедработникПослерейсовый"; 
							НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
						КонецЕсли;
					КонецЕсли;
				Иначе
					ВидПодписи = "МедработникПослерейсовый"; 
					НовыйСтатус = Справочники.уатСтатусы_уэ.ЭПЛ_Титул6;
				КонецЕсли;
			КонецЕсли;
			
			Запрос = Новый Запрос();
			Запрос.УстановитьПараметр("ПутевойЛист", ТекПЛ.ДокументОснование);
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	уатСтатусыПЛСрезПоследних.Статус КАК Статус
			|ИЗ
			|	РегистрСведений.уатСтатусыПЛ.СрезПоследних КАК уатСтатусыПЛСрезПоследних
			|ГДЕ
			|	уатСтатусыПЛСрезПоследних.ПутевойЛист = &ПутевойЛист";
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				СтатусДокумента = Справочники.уатСтатусы_уэ.НеРассчитан;
			Иначе
				ВыборкаДокумент = РезультатЗапроса.Выбрать();
				Если ВыборкаДокумент.Следующий() Тогда 
					СтатусДокумента = ВыборкаДокумент.Статус;
				Иначе 
					СтатусДокумента = Справочники.уатСтатусы_уэ.НеРассчитан;
				КонецЕсли;
			КонецЕсли;
			
			Если СтатусДокумента <> Справочники.уатСтатусы_уэ.ОтменаРейса Тогда
				Если ОтменаРейса Тогда
					уатОбменСГИСЭПД.УстановитьСтатусОтменаРейса(ТекПЛ.ДокументОснование); 
					НовыйСтатус = Справочники.уатСтатусы_уэ.ОтменаРейса;
				Иначе
					ДанныеСостоянияЭДО = ИнтеграцияЭДОВызовСервера.ДанныеСостоянияЭДОДляФормыОбъектаУчета(ЭПЛ);
					Если ДанныеСостоянияЭДО.ПредставлениеСостояния = "Закрыт с отклонением" Тогда
						уатОбменСГИСЭПД.УстановитьСтатусОтменаРейса(ТекПЛ.ДокументОснование); 
						НовыйСтатус = Справочники.уатСтатусы_уэ.ОтменаРейса;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;

			Если СтатусДокумента <> НовыйСтатус 
				И НовыйСтатус <> Неопределено
				И НовыйСтатус <> Справочники.уатСтатусы_уэ.ОтменаРейса Тогда
				Документы.уатПутевойЛист.УстановитьСтатус(ТекПЛ.ДокументОснование, НовыйСтатус, ЭПЛ);
			КонецЕсли;
			
			уатЗащищенныеФункцииСервер_проф.ОбновитьСостояниеПодписейЖурналы(ТекПЛ.ДокументОснование, ВидПодписи, СостояниеПодписей);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

// Вызов данное процедуры происходит при записи документа ЭПД.
//
// Параметры:
//  Источник - РегистрСведенийНаборЗаписей.СостоянияПоОбъектамУчетаЭДО - Набор записей регистра сведений
//  Отказ - Булево - Признак отказа от записи
//  Замещение - Булево - Замещение.
//
Процедура уатПередЗаписьюРеестрЭПД(Источник, Отказ, Замещение) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли;
 	
	СтарыйНабор = РегистрыСведений.РеестрЭПД.СоздатьНаборЗаписей();
	Для Каждого ЭлементОтбора Из Источник.Отбор Цикл
		Если ЭлементОтбора.Использование Тогда
			СтарыйНабор.Отбор[ЭлементОтбора.Имя].Установить(ЭлементОтбора.Значение);
		КонецЕсли;
	КонецЦикла;
	СтарыйНабор.Прочитать();
	
	СоответвиеСостояний = Новый Соответствие();
	Для Каждого СтрокаНабора Из СтарыйНабор Цикл  
		Если ТипЗнч(СтрокаНабора.Ссылка) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист") Тогда 
			СоответвиеСостояний.Вставить(СтрокаНабора.Ссылка, Новый Структура("Выполнен, Состояние", 
				СтрокаНабора.ТекущийШагВыполнен, СтрокаНабора.ТекущийШаг));
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтрокаНабора Из Источник Цикл  
		Если ТипЗнч(СтрокаНабора.Ссылка) = Тип("ДокументСсылка.ЭлектронныйПутевойЛист") Тогда
			СоответвиеСостояний.Вставить(СтрокаНабора.Ссылка, Новый Структура("Выполнен, Состояние", 
				СтрокаНабора.ТекущийШагВыполнен, СтрокаНабора.ТекущийШаг));
		КонецЕсли;
	КонецЦикла;  
	
	Источник.ДополнительныеСвойства.Вставить("СоответвиеСостояний", СоответвиеСостояний);

КонецПроцедуры

#КонецОбласти
